In [30]:
import pandas as pd
import numpy as np

In [31]:
obj = pd.Series(np.arange(5), index = [1,2,3,4,5])
obj

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [32]:
obj[2]

np.int64(1)

In [33]:
obj[0:3]

1    0
2    1
3    2
dtype: int64

In [34]:
obj[[1,2]]

1    0
2    1
dtype: int64

### DataFrame Indexing

In [35]:
data = pd.DataFrame(np.arange(16).reshape(4, 4),
                    index = ["Tokyo", "Berlin", "China", "Japan"],
                    columns = ["one", "two", "three", "four"])

data

        one  two  three  four
Tokyo     0    1      2     3
Berlin    4    5      6     7
China     8    9     10    11
Japan    12   13     14    15

In [36]:
data.two

Tokyo      1
Berlin     5
China      9
Japan     13
Name: two, dtype: int64

In [37]:
data[:2]

        one  two  three  four
Tokyo     0    1      2     3
Berlin    4    5      6     7

In [38]:
data[data['four'] > 5]

        one  two  three  four
Berlin    4    5      6     7
China     8    9     10    11
Japan    12   13     14    15

In [39]:
data[data < 5] = 0
data

        one  two  three  four
Tokyo     0    0      0     0
Berlin    0    5      6     7
China     8    9     10    11
Japan    12   13     14    15

### Selecting with iloc and loc

In [41]:
# 1st row and 1th, 2nd, and 3rd col selection 
data.iloc[1, [1,2,3]]

two      5
three    6
four     7
Name: Berlin, dtype: int64

In [42]:
data.iloc[[1,3], [1,2,3]]

        two  three  four
Berlin    5      6     7
Japan    13     14    15

In [43]:
toy_data = pd.Series(np.arange(5), index = ["a", "b", "c", "d", "e"])
toy_data

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [45]:
toy_data[-1]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_14940\3728369251.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  toy_data[-1]

np.int64(4)